src/rebar.org
#+OPTIONS: ^:{}
#+TITLE: Все, что вы хотели знать о Rebar, но ленились прочитать

Давеча, 15 февраля, побывал в Днепропетровске на конференции [[http://douua.org/calendar/4292/][Erlang
Dnipro 2014]], организованной Сергеем Костюшкиным. Конфа получилась
хорошая.  Сергее планирует сделать ее ежегодной. Посмотрим, было бы
неплохо :)

Выступил с докладом про Rebar. Видео снимали, еще пока не готово.
[[http://www.slideshare.net/YuriZhloba/rebar][Презентация тут]], ну и текст выступления ниже )

* Все, что вы хотели знать о Rebar, но ленились прочитать

Если верить [[http://en.wikipedia.org/wiki/Rebar][википедии]], то Rebar -- это арматура для железобетонных конструкций :)

Но нас интересует не арматура, а известный инструмент для сборки Erlang-проектов.

Занимается он не только сборкой Erlang-проектов, но и многими другими
полезными вещами. А именно:
- сборка драйверов из сорцов С/C++;
- сборка прочих сопутствующих штук (ErlyDTL шаблоны, Protocol Buffers);
- создание приложений, модулей, тестов из шаблонов;
- подготовка релизов;
- управление зависимостями;
- запуск тестов (EUnit и Common Test);
- сборка escript-приложений;
- генерация документации;

Представляет собой одиночный исполняемый файл, который легко скачать,
положить в *PATH* или в проект, и запустить.

Так же Rebar, это [[https://github.com/rebar/rebar/][популярный проект на github.com]],
имеющий 117 контрибуторов, 100 форков и 12600 строк кода.


** Документация

Rebar легко использовать. Достаточно знать 4 команды
и уметь описывать зависимости в *rebar.config*.

А что бы разобраться чуть глубже, нужно заглянуть в документацию.
Она есть на [[https://github.com/rebar/rebar/wiki][github.com в виде wiki-страниц]].

И есть встроенная в сам Rebar и доступная из консоли:
#+BEGIN_SRC Shell-script
rebar help
rebar --commands
rebar help compile
rebar help get-deps
rebar help clean
#+END_SRC

Эти две документации пересекаются, но, в общем, не одинаковые.

Ну и 3-й источник информации -- это исходный код, конечно. Например,
подробнее об опциях для компиляции ErlyDTL шаблонов можно узнать
только в комментариях [[https://github.com/rebar/rebar/blob/master/src/rebar_erlydtl_compiler.erl][соответствующего исходника]]. Ибо в
wiki-документации такая компиляция упоминается без подробностей, а в
*rebar help compile* настройки перечисляются, но не объясняются.

Еще есть доклад Dave Smith, Erlang-разработчика из компании Basho на
Erlang User Conference 2012 [[http://www.erlang-factory.com/conference/ErlangUserConference2012/speakers/DizzySmith][Applied Rebar]].  Но, чесно говоря, этот
доклад ничего не добавляет к документации, и не избавляет от
необходимости ее читать.


** Основные команды

Начнем с 4х самых важных команд.

Допустим, мы только что клонировали из репозитория какой-то Erlang-проект и хотим его собрать.

В первую очередь нам нужно вытянуть зависимости для этого проекта:
#+BEGIN_SRC Shell-script
rebar get-deps
#+END_SRC

После чего проект можно собирать вместе с зависимостями.
#+BEGIN_SRC Shell-script
rebar compile
#+END_SRC

Ну вот и все, хватило даже 2-х команд :)

Кроме этого нужно уметь запускать юнит-тесты (у вас ведь есть юнит-тесты, правда? :)
#+BEGIN_SRC Shell-script
rebar eunit
#+END_SRC

И иногда нам захочется очистить проект, удалить все скомпилированные
файлы, и пересобрать все целиком с нуля:
#+BEGIN_SRC Shell-script
rebar clean
#+END_SRC

К этим командам добавим одну важную опцию: *skip_deps=true*

Вы вряд ли хотите пересобирать каждый раз все зависимости. Хотя Rebar
умный, пересобирает только измененные файлы, но если зависимостей
много, то Rebar все равно потратит лишние 1-2 секунды, чтобы все их
обойти, и все файлы там проверить. Поэтому:
#+BEGIN_SRC Shell-script
rebar compile skip_deps=true
#+END_SRC

Вы вряд ли хотите каждый раз запускать все тесты, которые имеются в
зависимостях. Зачем вам чужие тесты? А если они еще и падают? :) Да,
вы можете починить чужой код, но не прямо сейчас. У вас ведь своя
работа есть. Поэтому:
#+BEGIN_SRC Shell-script
rebar eunit skip_deps=true
#+END_SRC

Ну и чистить можно только свой проект, а зависимости оставить скомпилированными:
#+BEGIN_SRC Shell-script
rebar clean skip_deps=true
#+END_SRC

Ну вот, 4 команды, одна опция, и теперь вы все знатоки Rebar :)


** Компиляция

Теперь поговорим о главном -- о компиляции.

Rebar предполагает, что ваш проект организован согласно
[[http://www.erlang.org/doc/design_principles/des_princ.html][OTP Design Principles]] и, в частности, имеет типовую структуру:
- ebin -- сюда складываются скомпилированные beam-файлы
- include -- здесь находятся заголовочные hrl-файлы
- src -- здесь исходники, erl-файлы
- priv -- здесь всякие сопутствующие файлы, шаблоны, статика, скрипты и т.д.

К этой структуре Rebar добавляет свои соглашения:
- deps -- сюда выкачиваются зависимости
- test -- здесь находятся юнит-тесты
- c_src -- здесь находятся C/C++ сорцы

Проект с такой структурой, если он не имеет зависимостей,
собирается Rebar даже при отсутствии *rebar.config*.


*** erlc

Однако Rebar не сам компилирует сорцы, а доверяет это дело *erlc* --
компилятору, входящему в стандартную поставку Erlang. И прежде, чем
говорить, что делает Rebar, нужно рассказать, что делает erlc.
Наверняка вы это знаете, ведь как-то ж вы собираете свои проекты :)
Но все-таки уточним важные моменты.

[[http://www.erlang.org/doc/man/erlc.html][erlc]] не просто компилятор, а набор разных компиляторов. Ориентируясь
на расширение файла, он решает, что и чем нужно собирать, и поручает
сборку соответствующему тулу.

Если бы мы собирали наш типовой проект с помощью erlc,
то это выглядело бы, например, так:
#+BEGIN_SRC Shell-script
erlc -I include -o ebin src/*.erl
#+END_SRC

Опция *-I* указывает папку с хедер-файлами, опция *-o* указывает папку,
куда складывать результат компиляции, ну и *src/\*.erl* задает список
файлов, которые нужно скомпилировать.

Еще есть опции для определения макросов *-Dname=value*, для отключения
предупреждений *-W0* (никогда так не делайте :), или, наоборот, для
трактовки предупреждений как ошибок *-Werror* (а так можете делать :).
Ну и несколько других, не очень нужных.

Кроме компилятора erl-файлов, erlc еще включает, например, [[http://www.erlang.org/doc/man/yecc.html][Yecc]] --
парсер-генератор, умеющий создавать erl-сорцы из описаний грамматик в
форме Бэкуса — Наура.  И другие, не менее экзотические штуки.


