post/rebar.html
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>Все, что вы хотели знать о Rebar, но ленились прочитать</title>
    <link rel="stylesheet" type="text/css" href="/css/bootstrap.min.css" />
    <link rel="stylesheet" type="text/css" href="/css/main.css" />
  </head>
<body>

  <div id="header">
    <div id="main_title">
      <a href="/" style="color:#013;">Про Erlang и про всякое</a>
    </div>
    <div id="profile_link">
      <a href="https://plus.google.com/u/0/+YuriZhloba/about" style="color:#013;">Юра Жлоба</a>
    </div>
  </div>

<div id="content">
<h1>Все, что вы хотели знать о Rebar, но ленились прочитать</h1>
<p><i>19 февраля 2014</i></p>

<p>
Давеча, 15 февраля, побывал в Днепропетровске на конференции <a href="http://douua.org/calendar/4292/">Erlang
Dnipro 2014</a>, организованной Сергеем Костюшкиным. Конфа получилась
хорошая.  Сергее планирует сделать ее ежегодной. Посмотрим, было бы
неплохо :)
</p>

<p>
Выступил с докладом про Rebar.
<a href="http://www.slideshare.net/YuriZhloba/rebar">Презентация тут</a>, ну и текст выступления ниже )
</p>

<ul>
<li><a href="#sec-1-1">Документация</a></li>
<li><a href="#sec-1-2">Основные команды</a></li>
<li><a href="#sec-1-3">Компиляция</a>
<li><a href="#sec-1-4">Управление зависимостями</a></li>
<li><a href="#sec-1-5">Шаблоны</a></li>
<li><a href="#sec-1-6">Тестирование</a></li>
<li><a href="#sec-1-7">rebar.config</a></li>
<li><a href="#sec-1-8">Прочие возможности</a></li>
</ul>
</li>

<div id="outline-container-sec-1" class="outline-2">
<div class="outline-text-2" id="text-1">
<p>
Если верить <a href="http://en.wikipedia.org/wiki/Rebar">википедии</a>, то Rebar &#x2013; это арматура для железобетонных конструкций :)
</p>

<p>
Но нас интересует не арматура, а известный инструмент для сборки Erlang-проектов.
</p>

<p>
Занимается он не только сборкой Erlang-проектов, но и многими другими
полезными вещами. А именно:
</p>
<ul class="org-ul">
<li>сборка драйверов из сорцов С/C++;
</li>
<li>сборка прочих сопутствующих штук (ErlyDTL шаблоны, Protocol Buffers);
</li>
<li>создание приложений, модулей, тестов из шаблонов;
</li>
<li>подготовка релизов;
</li>
<li>управление зависимостями;
</li>
<li>запуск тестов (EUnit и Common Test);
</li>
<li>сборка escript-приложений;
</li>
<li>генерация документации;
</li>
</ul>

<p>
Представляет собой одиночный исполняемый файл, который легко скачать,
положить в <b>PATH</b> или в проект, и запустить.
</p>

<p>
Так же Rebar, это <a href="https://github.com/rebar/rebar/">популярный проект на github.com</a>,
имеющий 117 контрибуторов, 100 форков и 12600 строк кода.
</p>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h2 id="sec-1-1">Документация</h2>
<div class="outline-text-3" id="text-1-1">
<p>
Rebar легко использовать. Достаточно знать 4 команды
и уметь описывать зависимости в <b>rebar.config</b>.
</p>

<p>
А что бы разобраться чуть глубже, нужно заглянуть в документацию.
Она есть на <a href="https://github.com/rebar/rebar/wiki">github.com в виде wiki-страниц</a>.
</p>

<p>
И есть встроенная в сам Rebar и доступная из консоли:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar help
rebar --commands
rebar help compile
rebar help get-deps
rebar help clean
</pre>
</div>

<p>
Эти две документации пересекаются, но, в общем, не одинаковые.
</p>

<p>
Ну и 3-й источник информации &#x2013; это исходный код, конечно. Например,
подробнее об опциях для компиляции ErlyDTL шаблонов можно узнать
только в комментариях <a href="https://github.com/rebar/rebar/blob/master/src/rebar_erlydtl_compiler.erl">соответствующего исходника</a>. Ибо в
wiki-документации такая компиляция упоминается без подробностей, а в
<b>rebar help compile</b> настройки перечисляются, но не объясняются.
</p>

<p>
Еще есть доклад <b>Dave Smith</b>, Erlang-разработчика из компании <b>Basho</b> на
<b>Erlang User Conference 2012</b> <a href="http://www.erlang-factory.com/conference/ErlangUserConference2012/speakers/DizzySmith">Applied Rebar</a>.  Но, чесно говоря, этот
доклад ничего не добавляет к документации, и не избавляет от
необходимости ее читать.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h2 id="sec-1-2">Основные команды</h2>
<div class="outline-text-3" id="text-1-2">
<p>
Начнем с 4х самых важных команд.
</p>

<p>
Допустим, мы только что клонировали из репозитория какой-то Erlang-проект и хотим его собрать.
</p>

<p>
В первую очередь нам нужно вытянуть зависимости для этого проекта:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar get-deps
</pre>
</div>

<p>
После чего проект можно собирать вместе с зависимостями.
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar compile
</pre>
</div>

<p>
Ну вот и все, хватило даже 2-х команд :)
</p>

<p>
Кроме этого нужно уметь запускать юнит-тесты (у вас ведь есть юнит-тесты, правда? :)
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit
</pre>
</div>

<p>
И иногда нам захочется очистить проект, удалить все скомпилированные
файлы, и пересобрать все целиком с нуля:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar clean
</pre>
</div>

<p>
К этим командам добавим одну важную опцию: <b>skip_deps=true</b>
</p>

<p>
Вы вряд ли хотите пересобирать каждый раз все зависимости. Хотя Rebar
умный, пересобирает только измененные файлы, но если зависимостей
много, то Rebar все равно потратит лишние 1-2 секунды, чтобы все их
обойти, и все файлы там проверить. Поэтому:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar compile skip_deps=true
</pre>
</div>

<p>
Вы вряд ли хотите каждый раз запускать все тесты, которые имеются в
зависимостях. Зачем вам чужие тесты? А если они еще и падают? :) Да,
вы можете починить чужой код, но не прямо сейчас. У вас ведь своя
работа есть. Поэтому:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit skip_deps=true
</pre>
</div>

<p>
Ну и чистить можно только свой проект, а зависимости оставить скомпилированными:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar clean skip_deps=true
</pre>
</div>

<p>
Ну вот, 4 команды, одна опция, и теперь вы все знатоки Rebar :)
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h2 id="sec-1-3">Компиляция</h2>
<div class="outline-text-3" id="text-1-3">
<p>
Теперь поговорим о главном &#x2013; о компиляции.
</p>

<p>
Rebar предполагает, что ваш проект организован согласно
<a href="http://www.erlang.org/doc/design_principles/des_princ.html">OTP Design Principles</a> и, в частности, имеет типовую структуру:
</p>
<ul class="org-ul">
<li><b>ebin</b> &#x2013; сюда складываются скомпилированные beam-файлы;
</li>
<li><b>include</b> &#x2013; здесь находятся заголовочные hrl-файлы;
</li>
<li><b>src</b> &#x2013; здесь исходники, erl-файлы;
</li>
<li><b>priv</b> &#x2013; здесь всякие сопутствующие файлы, шаблоны, статика, скрипты и т.д.
</li>
</ul>

<p>
К этой структуре Rebar добавляет свои соглашения:
</p>
<ul class="org-ul">
<li><b>deps</b> &#x2013; сюда выкачиваются зависимости;
</li>
<li><b>test</b> &#x2013; здесь находятся юнит-тесты;
</li>
<li><b>c_src</b> &#x2013; здесь находятся C/C++ сорцы.
</li>
</ul>

<p>
Проект с такой структурой, если он не имеет зависимостей,
собирается Rebar даже при отсутствии <b>rebar.config</b>.
</p>
</div>


<div id="outline-container-sec-1-3-1" class="outline-4">
<h3 id="sec-1-3-1">erlc</h3>
<div class="outline-text-4" id="text-1-3-1">
<p>
Однако Rebar не сам компилирует сорцы, а доверяет это дело <b>erlc</b> &#x2013;
компилятору, входящему в стандартную поставку Erlang. И прежде, чем
говорить, что делает Rebar, нужно рассказать, что делает erlc.
Наверняка вы это знаете, ведь как-то ж вы собираете свои проекты :)
Но все-таки уточним важные моменты.
</p>

<p>
<a href="http://www.erlang.org/doc/man/erlc.html">erlc</a> не просто компилятор, а набор разных компиляторов. Ориентируясь
на расширение файла, он решает, что и чем нужно собирать, и поручает
сборку соответствующему тулу.
</p>

<p>
Если бы мы собирали наш типовой проект с помощью erlc,
то это выглядело бы, например, так:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">erlc -I include -o ebin src/*.erl
</pre>
</div>

<p>
Опция <b>-I</b> указывает папку с хедер-файлами, опция <b>-o</b> указывает папку,
куда складывать результат компиляции, ну и <b>src/*.erl</b> задает список
файлов, которые нужно скомпилировать.
</p>

<p>
Еще есть опции для определения макросов <b>-Dname=value</b>, для отключения
предупреждений <b>-W0</b> (никогда так не делайте :), или, наоборот, для
трактовки предупреждений как ошибок <b>-Werror</b> (а так можете делать :).
Ну и несколько других, не очень нужных.
</p>

<p>
Кроме компилятора erl-файлов, erlc еще включает, например, <a href="http://www.erlang.org/doc/man/yecc.html">Yecc</a> &#x2013;
парсер-генератор, умеющий создавать erl-сорцы из описаний грамматик в
форме Бэкуса — Наура.  И другие, не менее экзотические штуки.
</p>
</div>
</div>
