src/rebar.org
*** rebar

Ну вот, сорцы Erlang были скомпилированы с помощью ercl.
А что же к этому добавляет Rebar? Да многое.

Важная вещь в OTP-приложении, это файл *ebin/myapp.app*
описывающий метаинформацию о приложении: имя, номер версии, главный модуль,
зависимости от системных приложений. И, помимо прочего, там перечисляются
все модули, входящие в состав приложения. Без Rebar этот файл пришлось бы
поддерживать вручную -- не забывать добавлять туда все новые модули.

Вместо этого Rebar предлагает использовать файл *src/myapp.app.src*, где
указано все тоже самое, кроме списка модулей. Из него Rebar автоматически
генерирует *ebin/myapp.app*, но уже сам добавляет туда все модули, которые
есть в src. Ну а если вы, все-таки, создали *ebin/myapp.app* сами,
то Rebar проверит, чтобы там все модули были перечислены,
и чтобы не было указано лишних.

Далее, Rebar умеет компилировать C/C++ сорцы драйверов, если находит их в папке *c_src*.
Делает он это опять не сам, а поручает компиляторам *cc* и *c++*. Но контролирует
изменения в файлах сам.

Еще Rebar умеет компилировать шаблоны [[https://github.com/erlydtl/erlydtl][ErlyDTL]].  Это html-шаблоны,
такие же, как в *Django*, популярном веб фреймворке для Python.  Rebar
компилирует каждый шаблон в отдельный Erlang-модуль, сразу в
beam-файл.  Вернее, он опять не сам это делает, а поручает
компилятору, входящему в состав библиотеки *erlydtl*.

И это еще не все :)

Есть такая популярная библиотека сериализации данных [[https://developers.google.com/protocol-buffers/docs/overview?hl=ru-RU&csw=1][Google Protocol
Buffers]], она же *protobuf*. Фишка этой библиотеки в том, что данные
описываются в текстовых *proto* файлах, из которых автоматически
генерируется клиентский и серверный код, описывающий соответствующие
объекты на нужном языке программирования. Сам гугл поддерживает
генерацию кода для *Java*, *Python* и *C++*. Но есть сторонние
библиотеки для других языков, в т.ч. и для Erlang --
[[https://github.com/ngerakines/erlang_protobuffs][erlang_protobuffs]].

Rebar умеет генерировать из *proto* файла Erlang-модуль (erl) и хедер файл (hrl).
Как вы уже догадались, он делает это не сам, а поручает компилятору,
входящему в состав библиотеки *erlang_protobuffs* :)

Ну, теперь все.


** Управление зависимостями

Rebar умеет клонировать и собирать зависимые библиотеки из репозиториев git, mercurial и bazaar.

Для этого зависимости нужно описать в *rebar.config*
#+BEGIN_SRC erlang
{deps, [Dependency1,
        Dependency2,
        Dependency3]}.
#+END_SRC

где *Dependency* это
#+BEGIN_SRC erlang
{App, VsnRegex, Source}
#+END_SRC

*App* -- имя OTP-приложения библиотеки,
*VsnRegex* -- регулярное выражение, с которым должна совпадать версия библиотеки
*Source* -- источник, откуда брать исходные коды.

Источник описывается так:
#+BEGIN_SRC erlang
{git, Url, Rev}
{hg,  Url, Rev}
{bzr, Url, Rev}
#+END_SRC

*Url* -- путь к репозиторию
*Rev* -- ветка, тэг или коммит

#+BEGIN_SRC erlang
{branch, "master"}
{tag, "v1.0"}
"62b7c9b12daacfcbcf274bc0925a7f8d10e3a1e0"
"v1.0"
"HEAD"
""
#+END_SRC

Пример:
#+BEGIN_SRC Erlang
{deps, [
    {emysql, ".*", {git, "https://github.com/Eonblast/Emysql.git",
                    "62b7c9b12daacfcbcf274bc0925a7f8d10e3a1e0"}},
    {mcd, ".*", {git, "https://github.com/EchoTeam/mcd.git",
                 "f72ebf5006e1b1234e16f86514e4291c57506024"}},
    {cowboy, ".*", {git, "https://github.com/extend/cowboy", "0.8.6"}},
    {mimetypes, ".*", {git, "git://github.com/spawngrid/mimetypes.git", {branch, "master"}}},
    {lager, ".*", {git, "https://github.com/basho/lager.git", "2.0.1"}},
    {ux, ".*", {git, "https://github.com/erlang-unicode/ux.git", "v3.4.1"}}
    ]}.
#+END_SRC

Оптимально указывать зависимость от конкретного тэга или
комита. Зависимость от ветки без указания комита таит
опасность. Библиотека позже может измениться, причем несовместимо с
вашим кодом.  Хорошо, если автор библиотеки управляет версиями и
помечает их тэгами. Но часто тэгов нет.  Тогда лучше указать последний
комит на тот момент, когда вы клонировали библиотеку.

Подразумевается, что все эти зависимости тоже собираются Rebar. И
они тоже могут иметь свой rebar.config и свои зависимости
(транзитивные).  Например, *cowboy* зависит от *ranch*. Если это так,
то Rebar клонирует и соберет транзивные зависимости тоже.

Однако может быть так, что вам нужна какая-то библиотека, которая
не собирается Rebar. Тогда зависимость указывается так:
#+BEGIN_SRC Erlang
{somelib, ".*", {git, "https://somewhere.com/somelib.git", "v1.0"}, [raw]}
#+END_SRC

Тогда Rebar скачает ее сорцы, но не будет компилировать. Вам придется
собрать ее отдельно.

Кроме уже известной нам команды *get-deps* есть несколько других

*check-deps* проверяет, все ли зависимости клонированы. Не проверяет
 транзитивные зависимости.

*list-deps* проверяет, все ли зависимости клонированы в
 т.ч. транзитивные. Выводит информацию о каждой зависимости: имя
 приложения, номер версии, источник.

*update-deps* обновляет зависимости, клонирует свежие версии. Тут
 Rebar проверяет конфликты версий библиотек. И выдает ошибку, если
 одна и та же библиотека, но разных версий, является
 зависимостью. Интересно, что Rebar этого не делает в get-deps и
 compile :)

*delete-deps* удаляет зависимости, оставляет пустую папку deps.


