post/rebar.html

<div id="outline-container-sec-1-3-2" class="outline-4">
<h3 id="sec-1-3-2">rebar</h3>
<div class="outline-text-4" id="text-1-3-2">
<p>
Ну вот, сорцы Erlang были скомпилированы с помощью ercl.
А что же к этому добавляет Rebar? Да многое.
</p>

<p>
Важная вещь в OTP-приложении, это файл <b>ebin/myapp.app</b>,
описывающий метаинформацию о приложении: имя, номер версии, главный модуль,
зависимости от системных приложений. И, помимо прочего, там перечисляются
все модули, входящие в состав приложения. Без Rebar этот файл пришлось бы
поддерживать вручную &#x2013; не забывать добавлять туда все новые модули.
</p>

<p>
Вместо этого Rebar предлагает использовать файл <b>src/myapp.app.src</b>, где
указано все тоже самое, кроме списка модулей. Из него Rebar автоматически
генерирует <b>ebin/myapp.app</b>, но уже сам добавляет туда все модули, которые
есть в src. Ну а если вы, все-таки, создали <b>ebin/myapp.app</b> сами,
то Rebar проверит, чтобы там все модули были перечислены,
и чтобы не было указано лишних.
</p>

<p>
Далее, Rebar умеет компилировать C/C++ сорцы драйверов, если находит их в папке <b>c_src</b>.
Делает он это опять не сам, а поручает компиляторам <b>cc</b> и <b>c++</b>. Но контролирует
изменения в файлах сам.
</p>

<p>
Еще Rebar умеет компилировать шаблоны <a href="https://github.com/erlydtl/erlydtl">ErlyDTL</a>.  Это html-шаблоны,
такие же, как в <b>Django</b>, популярном веб фреймворке для Python.  Rebar
компилирует каждый шаблон в отдельный Erlang-модуль, сразу в
beam-файл.  Вернее, он опять не сам это делает, а поручает
компилятору, входящему в состав библиотеки <b>erlydtl</b>.
</p>

<p>
И это еще не все :)
</p>

<p>
Есть такая популярная библиотека сериализации данных <a href="https://developers.google.com/protocol-buffers/docs/overview?hl=ru-RU&csw=1">Google Protocol
Buffers</a>, она же <b>protobuf</b>. Фишка этой библиотеки в том, что данные
описываются в текстовых <b>proto</b> файлах, из которых автоматически
генерируется клиентский и серверный код, описывающий соответствующие
объекты на нужном языке программирования. Сам гугл поддерживает
генерацию кода для <b>Java</b>, <b>Python</b> и <b>C++</b>. Но есть сторонние
библиотеки для других языков, в т.ч. и для Erlang &#x2013;
<a href="https://github.com/ngerakines/erlang_protobuffs">erlang_protobuffs</a>.
</p>

<p>
Rebar умеет генерировать из <b>proto</b> файла Erlang-модуль (erl) и хедер файл (hrl).
Как вы уже догадались, он делает это не сам, а поручает компилятору,
входящему в состав библиотеки <b>erlang_protobuffs</b> :)
</p>

<p>
Ну, теперь все.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h2 id="sec-1-4">Управление зависимостями</h2>
<div class="outline-text-3" id="text-1-4">
<p>
Rebar умеет клонировать и собирать зависимые библиотеки из репозиториев git, mercurial и bazaar.
</p>

<p>
Для этого зависимости нужно описать в <b>rebar.config</b>
</p>
<div class="org-src-container">

<pre class="src src-erlang">{deps, [Dependency1,
        Dependency2,
        Dependency3]}.
</pre>
</div>

<p>
где <b>Dependency</b> это
</p>
<div class="org-src-container">

<pre class="src src-erlang">{App, VsnRegex, Source}
</pre>
</div>

<p><b>App</b> &#x2013; имя OTP-приложения библиотеки,</p>
<p><b>VsnRegex</b> &#x2013; регулярное выражение, с которым должна совпадать версия библиотеки</p>
<p><b>Source</b> &#x2013; источник, откуда брать исходные коды. </p>

<p>
Источник описывается так:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{git, Url, Rev}
{hg,  Url, Rev}
{bzr, Url, Rev}
</pre>
</div>

<p>
<b>Url</b> &#x2013; путь к репозиторию
<b>Rev</b> &#x2013; ветка, тэг или коммит
</p>

<div class="org-src-container">

<pre class="src src-erlang">{branch, "master"}
{tag, "v1.0"}
"62b7c9b12daacfcbcf274bc0925a7f8d10e3a1e0"
"v1.0"
"HEAD"
""
</pre>
</div>

<p>
Пример:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{deps, [
    {emysql, ".*", {git, "https://github.com/Eonblast/Emysql.git",
                    "62b7c9b12daacfcbcf274bc0925a7f8d10e3a1e0"}},
    {mcd, ".*", {git, "https://github.com/EchoTeam/mcd.git",
                 "f72ebf5006e1b1234e16f86514e4291c57506024"}},
    {cowboy, ".*", {git, "https://github.com/extend/cowboy", "0.8.6"}},
    {mimetypes, ".*", {git, "git://github.com/spawngrid/mimetypes.git", {branch, "master"}}},
    {lager, ".*", {git, "https://github.com/basho/lager.git", "2.0.1"}},
    {ux, ".*", {git, "https://github.com/erlang-unicode/ux.git", "v3.4.1"}}
    ]}.
</pre>
</div>

<p>
Оптимально указывать зависимость от конкретного тэга или
комита. Зависимость от ветки без указания комита таит
опасность. Библиотека позже может измениться, причем несовместимо с
вашим кодом.  Хорошо, если автор библиотеки управляет версиями и
помечает их тэгами. Но часто тэгов нет.  Тогда лучше указать последний
комит на тот момент, когда вы клонировали библиотеку.
</p>

<p>
Подразумевается, что все эти зависимости тоже собираются Rebar. И
они тоже могут иметь свой rebar.config и свои зависимости
(транзитивные).  Например, <b>cowboy</b> зависит от <b>ranch</b>. Если это так,
то Rebar клонирует и соберет транзивные зависимости тоже.
</p>

<p>
Однако может быть так, что вам нужна какая-то библиотека, которая
не собирается Rebar. Тогда зависимость указывается так:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{somelib, ".*", {git, "https://somewhere.com/somelib.git", "v1.0"}, [raw]}
</pre>
</div>

<p>
Тогда Rebar скачает ее сорцы, но не будет компилировать. Вам придется
собрать ее отдельно.
</p>

<p>
Кроме уже известной нам команды <b>get-deps</b> есть несколько других
</p>

<p>
<b>check-deps</b> проверяет, все ли зависимости клонированы. Не проверяет
 транзитивные зависимости.
</p>

<p>
<b>list-deps</b> проверяет, все ли зависимости клонированы в
 т.ч. транзитивные. Выводит информацию о каждой зависимости: имя
 приложения, номер версии, источник.
</p>

<p>
<b>update-deps</b> обновляет зависимости, клонирует свежие версии. Тут
 Rebar проверяет конфликты версий библиотек. И выдает ошибку, если
 одна и та же библиотека, но разных версий, является
 зависимостью. Интересно, что Rebar этого не делает в get-deps и
 compile :)
</p>

<p>
<b>delete-deps</b> удаляет зависимости, оставляет пустую папку deps.
</p>
</div>
</div>
