src/rebar.org
** Шаблоны

Интересная фишка Rebar -- создание приложений, модулей, ген-серверов, тестов
и пр. из шаблонов с помощью команды *create*.
#+BEGIN_SRC Shell-script
rebar create template= [var=foo,...]
#+END_SRC

Например, вот так можно создать новое приложение:
#+BEGIN_SRC Shell-script
rebar create template=simpleapp appid=myapp
#+END_SRC

А вот так можно создать модуль gen_server:
#+BEGIN_SRC Shell-script
rebar create template=simplesrv srvid=my_server
#+END_SRC

Для самых важных шаблонов есть сокращенный вариант:
#+BEGIN_SRC Shell-script
rebar create-app appid=myapp
rebar create-node nodeid=mynode
#+END_SRC

Список всех шаблонов можно посмотреть командой *list-templates*
#+BEGIN_SRC Shell-script
rebar list-templates
#+END_SRC

У этой команды есть странность. Она зачем-то рекурсивно обходит все
каталоги внутри текущего каталога, и для всех найденных
erlang-проектов показывает один и тот же список. Зачем нужно лазить по
каталогам, а не понял.  Если запустить в своем домашнем каталоге, то
она будет работать долго. И у меня падает с ошибкой на каком-то
проекте :)

Если запустить в пустом каталоге, то вывод будет таким:

#+BEGIN_SRC Shell-script
yura ~/tmp $ rebar list-templates
==> tmp (list-templates)
  * simplesrv: priv/templates/simplesrv.template (escript) (variables: "srvid")
  * simplenode: priv/templates/simplenode.template (escript) (variables: "nodeid")
  * simplemod: priv/templates/simplemod.template (escript) (variables: "modid")
  * simplefsm: priv/templates/simplefsm.template (escript) (variables: "fsmid")
  * simpleapp: priv/templates/simpleapp.template (escript) (variables: "appid")
  * ctsuite: priv/templates/ctsuite.template (escript) (variables: "testmod")
  * basicnif: priv/templates/basicnif.template (escript) (variables: "module")
#+END_SRC

Rebar показывает имя шаблона, где он хранится в проекте rebar, и
какие переменные можно подставить.

К сожалению, документации по шаблонам нет в вики. И *rebar help
create* тоже не показывает ничего интересного. Так что нужно просто
пробовать и смотреть, что получается.

Создадим приложение:
#+BEGIN_SRC Shell-script
yura ~/p $ mkdir coolstuff; cd coolstuff
yura ~/p/coolstuff $ rebar create template=simpleapp appid=coolstuff
==> coolstuff (create)
Writing src/coolstuff.app.src
Writing src/coolstuff_app.erl
Writing src/coolstuff_sup.erl
yura ~/p/coolstuff $ tree
.
└── src
    ├── coolstuff_app.erl
    ├── coolstuff.app.src
    └── coolstuff_sup.erl

1 directory, 3 files
#+END_SRC

Как видно, Rebar сгенерировал модуль приложения, модуль корневого
супервизора и .app.src файл.  Дал соответствующие имена файлам, и
подставил соответствующие *-module(name)* конструкции в них.

Добавим в него модуль ген-сервер:
#+BEGIN_SRC Shell-script
yura ~/p/coolstuff $ rebar create template=simplesrv srvid=my_server
==> coolstuff (create)
Writing src/my_server.erl
yura ~/p/coolstuff $ cat src/my_server.erl
-module(my_server).
-behaviour(gen_server).
-define(SERVER, ?MODULE).
...
#+END_SRC

Добавим еще один модуль:
#+BEGIN_SRC Shell-script
yura ~/p/coolstuff $ rebar create template=simplemod modid=my_cool_module
==> coolstuff (create)
Writing src/my_cool_module.erl
Writing test/my_cool_module_tests.erl
yura ~/p/coolstuff $ cat src/my_cool_module.erl
-module(my_cool_module).

-export([my_func/0]).

my_func() ->
    ok.
yura ~/p/coolstuff $ cat test/my_cool_module_tests.erl
-module(my_cool_module_tests).
-include_lib("eunit/include/eunit.hrl").
#+END_SRC

Rebar создал не только модуль, но и тесты для него.

Все шаблоны можно найти на
[[https://github.com/rebar/rebar/tree/master/priv/templates][github в проекте rebar]].
в папке *priv/templates*.
#+BEGIN_SRC Shell-script
yura ~/p/rebar/priv/templates $ ls -1 *.template
basicnif.template
ctsuite.template
simpleapp.template
simplefsm.template
simplemod.template
simplenode.template
simplesrv.template
#+END_SRC

Итого их 7 штук.

Как они устроены? Довольно просто:
#+BEGIN_SRC Shell-script
yura ~/p/rebar/priv/templates $ ls -1 simpleapp*
simpleapp_app.erl
simpleapp.app.src
simpleapp_sup.erl
simpleapp.template
yura ~/p/rebar/priv/templates $ cat simpleapp.template
{variables, [{appid, "myapp"}]}.
{template, "simpleapp.app.src", "src/{{appid}}.app.src"}.
{template, "simpleapp_app.erl", "src/{{appid}}_app.erl"}.
{template, "simpleapp_sup.erl", "src/{{appid}}_sup.erl"}.
#+END_SRC

Есть *template* файл, который указывает, имеющиеся переменные и их
дефолтные значения, и какие еще файлы входят в шаблон. И есть
файлы-заготовки. Посмотрев все это, мы знаем, какие файлы будут
созданы, какой код в них будет сгенерирован, и какие переменные нужно
указать.

Эти три шаблона мы уже попробовали:
- *simpleapp* -- создает приложение;
- *simplesrv* -- создает gen_server модуль;
- *simplemod* -- создает пустой модуль;

Еще есть:
- *simplefsm* -- создает gen_fsm модуль;
- *basicnif* -- заготовка для порта, создает erlang-модуль и с-файл;
- *ctsuite* -- создает common test suite модуль в папке test;
- *simplenode* -- самый сложный шаблон, создает файлы для релиза.

В свежей версии Rebar появился еще *simplelib*, но в установленном у
меня Rebar такого шаблона нет.

Все эти шаблоны находятся внутри файла Rebar в архивированом
виде. Если хочется что-то в них поменять, то есть два пути. Либо
клонировать проект Rebar, изменить в нем шаблоны, и собрать свою
версию Rebar. Либо положить шаблоны в папку *~/.rebar/templates*.
#+BEGIN_SRC Shell-script
yura ~ $ mkdir -p .rebar/templates
yura ~ $ cp p/rebar/priv/templates/simplemod* .rebar/templates
#+END_SRC
И изменить их там.

В первом варианте измененный Rebar можно использовать для всех
разработчиков в команде. Во втором варианте измененные шаблоны будут
только у вас.

В *~/.rebar/templates* можно добавлять свои собственные шаблоны.
Их довольно легко сделать, взяв за основу стандартные.


