post/rebar.html

<div id="outline-container-sec-1-5" class="outline-3">
<h2 id="sec-1-5">Шаблоны</h2>
<div class="outline-text-3" id="text-1-5">
<p>
Интересная фишка Rebar &#x2013; создание приложений, модулей, ген-серверов, тестов
и пр. из шаблонов с помощью команды <b>create</b>.
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar create template= [var=foo,...]
</pre>
</div>

<p>
Например, вот так можно создать новое приложение:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar create template=simpleapp appid=myapp
</pre>
</div>

<p>
А вот так можно создать модуль gen_server:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar create template=simplesrv srvid=my_server
</pre>
</div>

<p>
Для самых важных шаблонов есть сокращенный вариант:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar create-app appid=myapp
rebar create-node nodeid=mynode
</pre>
</div>

<p>
Список всех шаблонов можно посмотреть командой <b>list-templates</b>
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar list-templates
</pre>
</div>

<p>
У этой команды есть странность. Она зачем-то рекурсивно обходит все
каталоги внутри текущего каталога, и для всех найденных
erlang-проектов показывает один и тот же список. Зачем нужно лазить по
каталогам, я не понял.  Если запустить в своем домашнем каталоге, то
она будет работать долго. И у меня падает с ошибкой на каком-то
проекте :)
</p>

<p>
Если запустить в пустом каталоге, то вывод будет таким:
</p>

<div class="org-src-container">

<pre class="src src-Shell-script">yura ~/tmp $ rebar list-templates
==&gt; tmp (list-templates)
  * simplesrv: priv/templates/simplesrv.template (escript) (variables: "srvid")
  * simplenode: priv/templates/simplenode.template (escript) (variables: "nodeid")
  * simplemod: priv/templates/simplemod.template (escript) (variables: "modid")
  * simplefsm: priv/templates/simplefsm.template (escript) (variables: "fsmid")
  * simpleapp: priv/templates/simpleapp.template (escript) (variables: "appid")
  * ctsuite: priv/templates/ctsuite.template (escript) (variables: "testmod")
  * basicnif: priv/templates/basicnif.template (escript) (variables: "module")
</pre>

<p>Rebar показывает имя шаблона, где он хранится в проекте rebar, и
какие переменные можно подставить.</p>

<p>К сожалению, документации по шаблонам нет в вики. И <b>rebar help
create</b> тоже не показывает ничего интересного. Так что нужно просто
пробовать и смотреть, что получается.</p>

<p>Создадим приложение:</p>
<pre class="src src-Shell-script"> yura ~/p $ mkdir coolstuff; cd coolstuff
yura ~/p/coolstuff $ rebar create template=simpleapp appid=coolstuff
==&gt; coolstuff (create)
Writing src/coolstuff.app.src
Writing src/coolstuff_app.erl
Writing src/coolstuff_sup.erl
yura ~/p/coolstuff $ tree
.
└── src
    ├── coolstuff_app.erl
    ├── coolstuff.app.src
    └── coolstuff_sup.erl

1 directory, 3 files
</pre>
</div>

<p>
Как видно, Rebar сгенерировал модуль приложения, модуль корневого
супервизора и .app.src файл.  Дал соответствующие имена файлам, и
подставил соответствующие <b>-module(name)</b> конструкции в них.
</p>

<p>
Добавим в него модуль ген-сервер:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">yura ~/p/coolstuff $ rebar create template=simplesrv srvid=my_server
==&gt; coolstuff (create)
Writing src/my_server.erl
yura ~/p/coolstuff $ cat src/my_server.erl
-module(my_server).
-behaviour(gen_server).
-define(SERVER, ?MODULE).
...
</pre>
</div>

<p>
Добавим еще один модуль:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">yura ~/p/coolstuff $ rebar create template=simplemod modid=my_cool_module
==&gt; coolstuff (create)
Writing src/my_cool_module.erl
Writing test/my_cool_module_tests.erl
yura ~/p/coolstuff $ cat src/my_cool_module.erl
-module(my_cool_module).

-export([my_func/0]).

my_func() -&gt;
    ok.
yura ~/p/coolstuff $ cat test/my_cool_module_tests.erl
-module(my_cool_module_tests).
-include_lib("eunit/include/eunit.hrl").
</pre>
</div>

<p>
Rebar создал не только модуль, но и тесты для него.
</p>

<p>
Все шаблоны можно найти на
<a href="https://github.com/rebar/rebar/tree/master/priv/templates">github в проекте rebar</a>.
в папке <b>priv/templates</b>.
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">yura ~/p/rebar/priv/templates $ ls -1 *.template
basicnif.template
ctsuite.template
simpleapp.template
simplefsm.template
simplemod.template
simplenode.template
simplesrv.template
</pre>
</div>

<p>
Итого их 7 штук.
</p>

<p>
Как они устроены? Довольно просто:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">yura ~/p/rebar/priv/templates $ ls -1 simpleapp*
simpleapp_app.erl
simpleapp.app.src
simpleapp_sup.erl
simpleapp.template
yura ~/p/rebar/priv/templates $ cat simpleapp.template
{variables, [{appid, "myapp"}]}.
{template, "simpleapp.app.src", "src/{{appid}}.app.src"}.
{template, "simpleapp_app.erl", "src/{{appid}}_app.erl"}.
{template, "simpleapp_sup.erl", "src/{{appid}}_sup.erl"}.
</pre>
</div>

<p>
Есть <b>template</b> файл, который указывает, имеющиеся переменные и их
дефолтные значения, и какие еще файлы входят в шаблон. И есть
файлы-заготовки. Посмотрев все это, мы знаем, какие файлы будут
созданы, какой код в них будет сгенерирован, и какие переменные нужно
указать.
</p>

<p>
Эти три шаблона мы уже попробовали:
</p>
<ul class="org-ul">
<li><b>simpleapp</b> &#x2013; создает приложение;
</li>
<li><b>simplesrv</b> &#x2013; создает gen_server модуль;
</li>
<li><b>simplemod</b> &#x2013; создает пустой модуль;
</li>
</ul>

<p>
Еще есть:
</p>
<ul class="org-ul">
<li><b>simplefsm</b> &#x2013; создает gen_fsm модуль;
</li>
<li><b>basicnif</b> &#x2013; заготовка для порта, создает erlang-модуль и с-файл;
</li>
<li><b>ctsuite</b> &#x2013; создает common test suite модуль в папке test;
</li>
<li><b>simplenode</b> &#x2013; самый сложный шаблон, создает файлы для релиза.
</li>
</ul>

<p>
В свежей версии Rebar появился еще <b>simplelib</b>, но в установленном у
меня Rebar такого шаблона нет.
</p>

<p>
Все эти шаблоны находятся внутри файла Rebar в архивированом
виде. Если хочется что-то в них поменять, то есть два пути. Либо
клонировать проект Rebar, изменить в нем шаблоны, и собрать свою
версию Rebar. Либо положить шаблоны в папку <b>~/.rebar/templates</b>.
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">yura ~ $ mkdir -p .rebar/templates
yura ~ $ cp p/rebar/priv/templates/simplemod* .rebar/templates
</pre>
</div>
<p>
И изменить их там.
</p>

<p>
В первом варианте измененный Rebar можно использовать для всех
разработчиков в команде. Во втором варианте измененные шаблоны будут
только у вас.
</p>

<p>
В <b>~/.rebar/templates</b> можно добавлять свои собственные шаблоны.
Их довольно легко сделать, взяв за основу стандартные.
</p>
</div>
</div>
