src/rebar.org
** Тестирование

Rebar умеет запускать тесты. С этим довольно просто:
#+BEGIN_SRC Shell-script
rebar eunit
#+END_SRC

При этом Rebar отдельно собирает проект с включенным макросом
*-DDEBUG=true* в папку *.eunit*, так что это не влияет на собранные в
обычном режиме beam-файлы.

Как уже сказано выше, обычно мы хотим запускать тесты только нашего проекта,
а не тесты зависимых библиотек:
#+BEGIN_SRC Shell-script
rebar eunit skip_deps=true
#+END_SRC

Когда мы работаем над конкретным модулем, лучше запускать тесты только
для этого модуля. И сборка быстрее, и инфа выводится только та, что нужна:
#+BEGIN_SRC Shell-script
rebar eunit skip_deps=true suites=module1_test
#+END_SRC

Можно запустить тесты для двух-трех модулей:
#+BEGIN_SRC Shell-script
rebar eunit skip_deps=true suites="module1_test,module2_test"
#+END_SRC

Можно запустить конкретные тесты в модуле:
#+BEGIN_SRC Shell-script
rebar eunit skip_deps=true suites=module1_test tests=some
rebar eunit skip_deps=true suites=module1_test tests="some,another"
#+END_SRC

Опция tests пока нестабильная, у меня, бывает, выдает ошибки.

Отчеты о тестах тоже сохраняются в папке *.eunit* в файлах *TEST-module1_test.xml*.
И если в *rebar.config* включена опция *cover_enabled*, то сохраняются также
отчеты о покрытии кода тестами в файлах *module1_test.COVER.html*.

Rebar также умеет запускать common test:
#+BEGIN_SRC Shell-script
rebar ct \[suites=\] \[case=\]
#+END_SRC

Но я их не использую, так что не буду углубляться.


** rebar.config

Еще одна важная тема -- конфигурирование Rebar.

Если ваш проект следует структуре OTP-приложения, не имеет зависимостей и
не требует нестандартных опций при сборке, то *rebar.config* не нужен. Впрочем,
его все равно лучше иметь, это сразу скажет другим разработчиком, что проект
собирается Rebar.

Настроек довольно много. Есть настройки общие для всех команд, есть специфические
для конкретной команды. Их можно увидеть, набрав *rebar help command*.

Пример конфига есть в проекте ребар: [[https://github.com/rebar/rebar/blob/master/rebar.config.sample][rebar.config.sample]]. Там указано
много разных опций с комментариями, но не все :)

Посмотрим некоторые из них.

*erl_opts* задают настройки компиляции:
#+BEGIN_SRC Erlang
{erl_opts, [debug_info,
            warn_export_all,
            warn_missing_spec,
            warning_as_errors,
            {parse_transform, lager_transform}
           ]}.
#+END_SRC

Поддерживаются все опции, которые есть у функции
[[http://www.erlang.org/doc/man/compile.html][compile:file/2]].

Примеры:
- *debug_info* -- включить отладочную информацию, нужную отладчику и *xref* тулу;
- *warnings_as_errors* -- считать предупреждения ошибками, и не компилировать код;
- *{d, Macro}* и *{d, Macro, Value}* -- определить макрос;
- *warn_export_all* -- предупреждать об использовании *export_all*;
- *bin_opt_info* -- предупреждать, если матчинг на binary может быть оптимизирован;

Можно переопределить стандартные папки:
- *src_dir* -- папка с исходниками;
- *deps_dir* -- папка с зависимостями;
- *target_dir* -- папка для скомпилированных beam-файлов;
- *{erl_opts, [{i, "my_include"}]}* -- папка с заголовочными файлами

Если в вашем проекте есть вложенные OTP-приложения, то нужны опции
*lib_dirs* и *sub_dirs*.
#+BEGIN_SRC Erlang
{lib_dirs, ["deps", "apps"]}.
{sub_dirs, ["apps/app1", "apps/app2"]}.
#+END_SRC

*lib_dirs* указывает папки, где нужно искать хедер-файлы, подключаемые через *include_lib*.
А *sub_dirs* указывает папки, где находятся вложенные приложения.

Сохранять отчеты о покрытии тестами:
#+BEGIN_SRC Erlang
{cover_enabled, true}.
#+END_SRC

Удалять файлы при очиске проекта (rebar clean):
#+BEGIN_SRC Erlang
{clean_files, ["erl_crash.dump"]}.
#+END_SRC

Настройки для утилиты [[http://www.Erlang.org/doc/man/xref.html][xref]]:
#+BEGIN_SRC Erlang
{xref_checks, [
    undefined_function_calls,
    undefined_functions,
    locals_not_used,
    exports_not_used,
    deprecated_function_calls,
    deprecated_functions
]}.
#+END_SRC

Что касается *rebar.config*, надо сказать, что здесь документация слабая. Я пересмотрел
много таких конфигов из разных проектов, и часто видел опции, нигде не документированные.
Например:
#+BEGIN_SRC Erlang
{erl_opts, [
            warn_missing_spec,
            warn_untyped_recod,
            fail_on_warning
           ]}.
#+END_SRC

Как они действуют, и действуют ли вообще как-нибудь, неизвестно :)

На самом деле все хорошо работает по-умолчанию, и настройки нужны
по-минимуму.  Самое главное, это *{deps, []}*, конечно. Все
предупреждения включены по умолчанию, специально включать их не нужно.
Полезная вещь *warning_as_errors*, хотя эта опция часто докучает. Тем,
кто использует *lager* не обойтись без
*{parse_transform, lager_transform}*.
Вот и все, этого достаточно для большинства проектов.


