post/rebar.html

<div id="outline-container-sec-1-6" class="outline-3">
<h2 id="sec-1-6">Тестирование</h2>
<div class="outline-text-3" id="text-1-6">
<p>
Rebar умеет запускать тесты. С этим довольно просто:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit
</pre>
</div>

<p>
При этом Rebar отдельно собирает проект с включенным макросом
<b>-DDEBUG=true</b> в папку <b>.eunit</b>, так что это не влияет на собранные в
обычном режиме beam-файлы.
</p>

<p>
Как уже сказано выше, обычно мы хотим запускать тесты только нашего проекта,
а не тесты зависимых библиотек:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit skip_deps=true
</pre>
</div>

<p>
Когда мы работаем над конкретным модулем, лучше запускать тесты только
для этого модуля. И сборка быстрее, и инфа выводится только та, что нужна:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit skip_deps=true suites=module1_test
</pre>
</div>

<p>
Можно запустить тесты для двух-трех модулей:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit skip_deps=true suites="module1_test,module2_test"
</pre>
</div>

<p>
Можно запустить конкретные тесты в модуле:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar eunit skip_deps=true suites=module1_test tests=some
rebar eunit skip_deps=true suites=module1_test tests="some,another"
</pre>
</div>

<p>
Опция tests пока нестабильная, у меня, бывает, выдает ошибки.
</p>

<p>
Отчеты о тестах тоже сохраняются в папке <b>.eunit</b> в файлах <b>TEST-module1_test.xml</b>.
И если в <b>rebar.config</b> включена опция <b>cover_enabled</b>, то сохраняются также
отчеты о покрытии кода тестами в файлах <b>module1_test.COVER.html</b>.
</p>

<p>
Rebar также умеет запускать common test:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">rebar ct \[suites=\] \[case=\]
</pre>
</div>

<p>
Но я их не использую, так что не буду углубляться.
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h2 id="sec-1-7">rebar.config</h2>
<div class="outline-text-3" id="text-1-7">
<p>
Еще одна важная тема &#x2013; конфигурирование Rebar.
</p>

<p>
Если ваш проект следует структуре OTP-приложения, не имеет зависимостей и
не требует нестандартных опций при сборке, то <b>rebar.config</b> не нужен. Впрочем,
его все равно лучше иметь, это сразу скажет другим разработчиком, что проект
собирается Rebar.
</p>

<p>
Настроек довольно много. Есть настройки общие для всех команд, есть специфические
для конкретной команды. Их можно увидеть, набрав <b>rebar help command</b>.
</p>

<p>
Пример конфига есть в проекте ребар: <a href="https://github.com/rebar/rebar/blob/master/rebar.config.sample">rebar.config.sample</a>. Там указано
много разных опций с комментариями, но не все :)
</p>

<p>
Посмотрим некоторые из них.
</p>

<p>
<b>erl_opts</b> задают настройки компиляции:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{erl_opts, [debug_info,
            warn_export_all,
            warn_missing_spec,
            warning_as_errors,
            {parse_transform, lager_transform}
           ]}.
</pre>
</div>

<p>
Поддерживаются все опции, которые есть у функции
<a href="http://www.erlang.org/doc/man/compile.html">compile:file/2</a>.
</p>

<p>
Примеры:
</p>
<ul class="org-ul">
<li><b>debug_info</b> &#x2013; включить отладочную информацию, нужную отладчику и <b>xref</b> тулу;
</li>
<li><b>warnings_as_errors</b> &#x2013; считать предупреждения ошибками, и не компилировать код;
</li>
<li><b>{d, Macro}</b> и <b>{d, Macro, Value}</b> &#x2013; определить макрос;
</li>
<li><b>warn_export_all</b> &#x2013; предупреждать об использовании <b>export_all</b>;
</li>
<li><b>bin_opt_info</b> &#x2013; предупреждать, если матчинг на binary может быть оптимизирован;
</li>
</ul>

<p>
Можно переопределить стандартные папки:
</p>
<ul class="org-ul">
<li><b>src_dir</b> &#x2013; папка с исходниками;
</li>
<li><b>deps_dir</b> &#x2013; папка с зависимостями;
</li>
<li><b>target_dir</b> &#x2013; папка для скомпилированных beam-файлов;
</li>
<li><b>{erl_opts, [{i, "my_include"}]}</b> &#x2013; папка с заголовочными файлами
</li>
</ul>

<p>
Если в вашем проекте есть вложенные OTP-приложения, то нужны опции
<b>lib_dirs</b> и <b>sub_dirs</b>.
</p>
<div class="org-src-container">

<pre class="src src-erlang">{lib_dirs, ["deps", "apps"]}.
{sub_dirs, ["apps/app1", "apps/app2"]}.
</pre>
</div>

<p>
<b>lib_dirs</b> указывает папки, где нужно искать хедер-файлы, подключаемые через <b>include_lib</b>.
А <b>sub_dirs</b> указывает папки, где находятся вложенные приложения.
</p>

<p>
Сохранять отчеты о покрытии тестами:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{cover_enabled, true}.
</pre>
</div>

<p>
Удалять файлы при очиске проекта (rebar clean):
</p>
<div class="org-src-container">

<pre class="src src-erlang">{clean_files, ["erl_crash.dump"]}.
</pre>
</div>

<p>
Настройки для утилиты <a href="http://www.erlang.org/doc/man/xref.html">xref</a>:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{xref_checks, [
    undefined_function_calls,
    undefined_functions,
    locals_not_used,
    exports_not_used,
    deprecated_function_calls,
    deprecated_functions
]}.
</pre>
</div>

<p>
Что касается <b>rebar.config</b>, надо сказать, что здесь документация слабая. Я пересмотрел
много таких конфигов из разных проектов, и часто видел опции, нигде не документированные.
Например:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{erl_opts, [
            warn_missing_spec,
            warn_untyped_recod,
            fail_on_warning
           ]}.
</pre>
</div>

<p>
Как они действуют, и действуют ли вообще как-нибудь, неизвестно :)
</p>

<p>
На самом деле все хорошо работает по-умолчанию, и настройки нужны
по-минимуму.  Самое главное, это <b>{deps, []}</b>, конечно. Все
предупреждения включены по умолчанию, специально включать их не нужно.
Полезная вещь <b>warning_as_errors</b>, хотя эта опция часто докучает. Тем,
кто использует <b>lager</b> не обойтись без
<b>{parse_transform, lager_transform}</b>.
Вот и все, этого достаточно для большинства проектов.
</p>
</div>
</div>
