src/rebar.org
** Прочие возможности

*rebar escriptize* создание escript-приложения. Об этом чуть
подробнее, потому что ребар сам является таким приложением.

escript -- это консольное приложение, которое должно работать как все
консольные утилиты unix-подобных ОС: получать аргументы на входе,
отрабатывать, выводить инфу на стандартный вывод, возвращать код
возврата и т.д. Не типичное применение Erlang, но иногда полезное.

escript файл, как и все скриптовые файлы, начинается с заголовка
#+BEGIN_SRC Shell-script
#!/usr/bin/env escript
#+END_SRC

Потом идут настройки для erlang vm. У самого rebar такие:
#+BEGIN_SRC Erlang
%%! -pa rebar/rebar/ebin
#+END_SRC

а потом возможны варианты:
- исходный код Erlang;
- бинарные данные скомпилированного beam-файла;
- бинарные данные zip-архива, содержащего beam-файлы.

Rebar представляет собой 3-й вариант. Его даже можно распаковать, только
сперва нужно переименовать файл, иначе он будет конфликтовать с именем
папки внутри архива.
#+BEGIN_SRC Shell-script
yura ~/tmp/look_inside_rebar $ mv rebar rebar_file
yura ~/tmp/look_inside_rebar $ unzip rebar_file
Archive:  rebar_file
warning [rebar_file]:  51 extra bytes at beginning or within zipfile
  (attempting to process anyway)
   creating: rebar/
   creating: rebar/ebin/
  inflating: rebar/ebin/getopt.beam
  inflating: rebar/ebin/mustache.beam
  inflating: rebar/ebin/rebar.app
  inflating: rebar/ebin/rebar.beam
  ...
   creating: priv/
   creating: priv/templates/
  inflating: priv/templates/basicnif.c
  inflating: priv/templates/basicnif.erl
  inflating: priv/templates/basicnif.template
  ...
#+END_SRC

Как видим, внутри beam-файлы и шаблоны. Ну вот, Rebar умеет создавать такие приложения,
в т.ч. самого себя :)

*rebar xref* проверка кода проекта утилитой [[http://www.erlang.org/doc/man/xref.html][xref]].  Анализирует
зависимости между приложениями, модулями и функциями. Сообщает о
неиспользуемых функциях и модулях, о вызовах несуществующих функций и
модулей и т.д.

*rebar doc* генерация документации утилитой [[http://www.erlang.org/doc/man/edoc.html][EDoc]].  Ну тут рассказывать
особо нечего, аналогичные тулы есть во многих других языка.

Ну и еще сборка релизов. Эту тему я не трогал, потому что это
отдельная большая тема.  И еще потому, что сам я релизы не
использую :)
