post/rebar.html

<div id="outline-container-sec-1-8" class="outline-3">
<h2 id="sec-1-8">Прочие возможности</h2>
<div class="outline-text-3" id="text-1-8">
<p>
<b>rebar escriptize</b> создание escript-приложения. Об этом чуть
подробнее, потому что ребар сам является таким приложением.
</p>

<p>
escript &#x2013; это консольное приложение, которое должно работать как все
консольные утилиты unix-подобных ОС: получать аргументы на входе,
отрабатывать, выводить инфу на стандартный вывод, возвращать код
возврата и т.д. Не типичное применение Erlang, но иногда полезное.
</p>

<p>
escript файл, как и все скриптовые файлы, начинается с заголовка
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">#!/usr/bin/env escript
</pre>
</div>

<p>
Потом идут настройки для erlang vm. У самого rebar такие:
</p>
<div class="org-src-container">

<pre class="src src-erlang">%%! -pa rebar/rebar/ebin
</pre>
</div>

<p>
а потом возможны варианты:
</p>
<ul class="org-ul">
<li>исходный код Erlang;
</li>
<li>бинарные данные скомпилированного beam-файла;
</li>
<li>бинарные данные zip-архива, содержащего beam-файлы.
</li>
</ul>

<p>
Rebar представляет собой 3-й вариант. Его даже можно распаковать, только
сперва нужно переименовать файл, иначе он будет конфликтовать с именем
папки внутри архива.
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">yura ~/tmp/look_inside_rebar $ mv rebar rebar_file
yura ~/tmp/look_inside_rebar $ unzip rebar_file
Archive:  rebar_file
warning [rebar_file]:  51 extra bytes at beginning or within zipfile
  (attempting to process anyway)
   creating: rebar/
   creating: rebar/ebin/
  inflating: rebar/ebin/getopt.beam
  inflating: rebar/ebin/mustache.beam
  inflating: rebar/ebin/rebar.app
  inflating: rebar/ebin/rebar.beam
  ...
   creating: priv/
   creating: priv/templates/
  inflating: priv/templates/basicnif.c
  inflating: priv/templates/basicnif.erl
  inflating: priv/templates/basicnif.template
  ...
</pre>
</div>

<p>
Как видим, внутри beam-файлы и шаблоны. Ну вот, Rebar умеет создавать такие приложения,
в т.ч. самого себя :)
</p>

<p>
<b>rebar xref</b> проверка кода проекта утилитой <a href="http://www.erlang.org/doc/man/xref.html">xref</a>.  Анализирует
зависимости между приложениями, модулями и функциями. Сообщает о
неиспользуемых функциях и модулях, о вызовах несуществующих функций и
модулей и т.д.
</p>

<p>
<b>rebar doc</b> генерация документации утилитой <a href="http://www.erlang.org/doc/man/edoc.html">EDoc</a>.  Ну тут рассказывать
особо нечего, аналогичные тулы есть во многих других языка.
</p>

<p>
Ну и еще сборка релизов. Эту тему я не трогал, потому что это
отдельная большая тема.  И еще потому, что сам я релизы не
использую :)
</p>
</div>
</div>
</div>
</div>

</body>
</html>
